<script>
export default {
  name: 'about',
  components: {},
  props: {},
  data() {
    return {};
  },
  computed: {},
  watch: {},
  created() {
  },
  methods: {}
};
</script>

<template>
  <article class="about">
    <h1>О Book Trade</h1>
    <section>
      <blockquote>
        "Книга не только сама является другом, она еще и находит для вас других друзей. Когда вы приняли книгу умом и
        душой, вы обогатились. Но когда вы передаете ее другим, вы обогащаетесь трижды. "
      </blockquote>
      <p class="author">
        <span>- Генри Миллер</span>
        <span>Книги в моей жизни (1969)</span>
      </p>
    </section>
    <section>
      <h2>Что такое Book Trade?</h2>
      <p>Это всемирная библиотека. Это праздник литературы и место, где книги получают новую жизнь. Здесь книге
        присваивается уникальный идентификатор, предоставляя возможность наблюдать, как книга путешествует из рук в
        руки. Таким образом проект объединяет читателей всего мира.</p>
      <p>Наше сообщество меняет мир.</p>
    </section>
    <section>
      <h2>Какова наша миссия?</h2>
      <p>Очень просто. Мы стремимся связывать людей через книги.</p>
    </section>
    <section>
      <h2>Как мы это делаем?</h2>
      <p><b>Отметь. Передай. Наблюдай.</b> Вдохни новую жизни в книги! Вместо того, чтобы позволять вашим старым
        любимцам
        собирать пыль - передавайте их другим читателям. Наш интернет-архив и система наблюдения позволяют участникам
        взаимодействовать с другими читателями, журналами, обзорной литературой и магазинами и наблюдать через "чтение и
        выпуск", как изменилась жизнь своих книг. Пользователи имеют возможность помечать и отслеживать свои личные
        книги.</p>
      <p>Так что будьте смелее с вашими книгами - <b>читайте и передавайте дальше.</b></p>
    </section>
    <section>
      <h2>Когда и как это началось?</h2>
      <p>Ранее были сайты, отслеживающие, например, денежные купюры и фотографии. Деловой партнер Рон Хорнбекер отметил,
        что ничего не существует для отслеживания книг. В конце концов, книги есть нечто большее, нежели просто
        материальный объект, и несмотря на то, что они лишены способности к эмоциональной привязанности и глубокому
        сопереживанию, их не только коллекционируют и благоволят им, но и с их помощью приобщаются к культурному опыту
        цивилизаций. Это была точка отсчета проекта... Наконец, 21 апреля 2001 года Рон, его жена Каори и соучредители
        Брюс и Хизер Педерсен запустили этот сайт. Он интересен в первую очередь для распространения и отслеживания
        книг. Люди, которые им пользуются, имеют возможность взаимодействовать и выстраивать с его помощью конструктивый
        диалог.</p>
    </section>
    <section>
      <h2>Кто мы?</h2>
      <p>Мы команда, которая продолжает основанное в Sandpoint, Айдахо дело. Однако, сайт не может функционировать без
        большого числа добровольцев со всего мира, которые помогают с различными проектами, распространяют движение и
        занимаются вопросами поддержки.</p>
    </section>
  </article>
</template>

<style lang="scss" scoped>
.about {
  background: var(--white);
  max-width: var(--defaultWidth);
  width: 100%;
  margin: 5.5rem auto 1rem;
  padding: 1rem;
  border-radius: var(--roundRadius);
  
  h1 {
    font-size: 64px;
    margin: 0 auto;
  }
  
  h2 {
    font-size: 32px;
    margin: 0 auto;
  }
  
  section {
    margin: 2rem auto;
  }
  
  blockquote {
    margin: 0 auto;
    font-size: 1.5rem;
    color: var(--footerText)
  }
  
  p {
    font-size: 1rem;
    color: var(--footerText)
  }
}

.author {
  display: flex;
  align-items: center;
  justify-content: flex-end;
  flex-wrap: wrap;
  text-align: right;
  
  
  & > * {
    width: 100%;
  }
}
</style>